---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Element..::..CanHaveTypeAssigned Method
Element Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned. |
|  | CanHaveTypeAssigned(Document, ICollection<(Of <<'(ElementId>)>>)) | Checks if all elements in the set can have a type assigned. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace